<a href="https://colab.research.google.com/github/devindianushika/data_analysis1/blob/master/dataCleaning.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Data Cleaning

In [ ]:
import pandas as pd

load data file

In [ ]:
df = pd.read_csv("test_with_col.csv")

In [ ]:
df.head()

      name age index_num    title
0  devindi  25    174057  gtghyyy
1  hashini  24    174073  fmgjukl
2   saduni  24    174071   kliopy
3  rajitha  23    174047   fgtyui
4    kamal  22    174051   hjukio

In [ ]:
df.tail()

      name age index_num   title
2   saduni  24    174071  kliopy
3  rajitha  23    174047  fgtyui
4    kamal  22    174051  hjukio
5    dasun   ?    175421       ?
6     john  45         ?       ?

identify missing values

In [ ]:
import numpy as np
#replace ? with Nan
df.replace("?", np.nan, inplace= True)

In [ ]:
df.head()

      name age index_num    title
0  devindi  25    174057  gtghyyy
1  hashini  24    174073  fmgjukl
2   saduni  24    174071   kliopy
3  rajitha  23    174047   fgtyui
4    kamal  22    174051   hjukio

In [ ]:
df.tail()

      name  age index_num   title
2   saduni   24    174071  kliopy
3  rajitha   23    174047  fgtyui
4    kamal   22    174051  hjukio
5    dasun  NaN    175421     NaN
6     john   45       NaN     NaN

In [ ]:
df.isnull().sum()

name         0
age          1
index_num    1
title        2
dtype: int64

In [ ]:
df.dtypes

name         object
age          object
index_num    object
title        object
dtype: object

In [ ]:
#convert age data type to integer
#get average of age
ave_age = df["age"].astype